АлогистикТест2/src/Documents/алк_РасходнаяНакладная/алк_РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПередачиСобственныеСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыПоАддендумам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>НАХЕРА?</comment>
    <type>
      <types>EnumRef.алк_ВидыДокументаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнерами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопАналитика</name>
    <type>
      <types>CatalogRef.алк_АналитикаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаИДКонтейнеров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Сток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПакетаГод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоотвАссортиментуЗаказа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контейнеры</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>DocumentRef.алк_ЗагрузкаКонтейнера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыНаСкладахСерии/алк_ЗапасыНаСкладахСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыНаСкладахСерии</name>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ТипСклада/алк_ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ТипСклада</name>
  <enumValues>
    <name>СГП</name>
  </enumValues>
  <enumValues>
    <name>Биржа</name>
  </enumValues>
  <enumValues>
    <name>Порт</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>СушильныйКомплекс</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/СерийныеНомера/СерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерийныеНомера</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Продан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйМеханизмУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_РасходнаяНакладная/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
	КонецЕсли;
		
	ДополнительныеСвойства.Вставить("ИспользоватьАддендумы", ТипЗнч(Заказ) = Тип("ДокументСсылка.алк_Аддендумы"));
	
	Если Не ДополнительныеСвойства.ИспользоватьАддендумы тогда
		//Если Не ЗначениеЗаполнено(ВидОперации) тогда
		//	ВидОперации = Перечисления.алк_ВидыДокументаРН.РеализацияЭкспортТД;
		//КонецЕсли;
		
		 
	Иначе 
		//Если Не СтруктурнаяЕдиница.алк_ТипСклада = Перечисления.алк_ТипСклада.Биржа Тогда   // Для биржи пока не применяем
		//Если Не Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
			Документы.алк_РасходнаяНакладная.УстановитьИдентификаторыТоваровАддендумов(ЭтотОбъект, Отказ);
		//КонецЕсли;		
		//КонецЕсли;
		
	КонецЕсли;  
	
	
	//Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		//ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена);  
				
		//Дата = //РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
				
	//КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда   
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|  алк_ОстаткиЗапасов.СерийныйНомер
		|ИЗ
		|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);  
		РезультатЗапроса = Запрос.Выполнить();  
		Выборка = РезультатЗапроса.Выгрузить();
		
		МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
		
		ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	И алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
			
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
		ДополнительныеСвойства.Вставить("КонтролироватьОстаткиНаДатуДокумента",Ложь);

	КонецЕсли;
	
	ОбъемДокумента = Запасы.Итог("Количество");
	КоличествоДокумента = Запасы.Итог("КоличествоПакетов");
	
	//Проверка совпадения даты смены и смены у транспортировки и расходной накладной 
	
	//если отменяют проведение тогда пусть осуществляется проверка при обработке удаления проведения
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Возврат;
	КонецЕсли; 
	//\\
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	ТранспортировкаНаОсновании = Документы.алк_РасходнаяНакладная.ДочернийТранспортировка(Ссылка);
	
	Если ЗначениеЗаполнено(ТранспортировкаНаОсновании) Тогда  
		
		Если ДатаСмены <> ТранспортировкаНаОсновании.ДатаСмены ИЛИ Смена <> ТранспортировкаНаОсновании.Смена  Тогда  
			
			Если ТранспортировкаНаОсновании.ДатаСмены <> ДатаСмены И ТранспортировкаНаОсновании.Смена <> Смена Тогда 
				Сообщить(СтрШаблон("В расходной накладной и документе %1 не совпадают даты смен и смены!",Строка(ТранспортировкаНаОсновании)));
			Иначе 			
				Если ДатаСмены <> ТранспортировкаНаОсновании.ДатаСмены Тогда  
					Сообщить(СтрШаблон("В расходной накладной и документе %1 не совпадают даты смен!",Строка(ТранспортировкаНаОсновании))); 
				КонецЕсли;
				
				Если Смена <> ТранспортировкаНаОсновании.Смена  Тогда
					Сообщить(СтрШаблон("В расходной накладной и документе %1 не совпадают смены!",Строка(ТранспортировкаНаОсновании))); 
				КонецЕсли;
			КонецЕсли;
			
			Отказ = Истина;  
			
		КонецЕсли;
		
	КонецЕсли;	
	//\\
	
КонецПроцедуры 

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
	КонецЕсли;
		
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.алк_РасходнаяНакладная.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	Если ДополнительныеСвойства.ИспользоватьАддендумы тогда
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
		
		// Отражение по "Последовательностям"
		РфпСервер.ОтразитьДокументыПоследовательностиПродукция(ДополнительныеСвойства, Движения, Отказ);
		
		// СерийныеНомера	
		РфпСервер.ОтразитьПакетыИсторияЗаказов(ДополнительныеСвойства, Движения, Отказ);
	
		//Сергеева Г.О. Оборотный регистр ++  
		РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. Оборотный регистр --
	КонецЕсли;
	
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --

	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	//РФП Закомментили 31.10.2023	
	//РфпСервер.ОтразитьПередачиСобственныеСерии(ДополнительныеСвойства, Движения, Отказ);	
	//\\
	
	Если ДополнительныеСвойства.ИспользоватьАддендумы И Не Сток тогда
		//РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение);  
		РфпСервер.ОтразитьАддендумы(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьПакетыПоАддендумам(ДополнительныеСвойства, Движения, Отказ);
		//РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		//// Контроль
		//Документы.алк_РасходнаяНакладная.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
		//Если Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда
		//	Отказ = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыНаСкладахСерии");
		//	Если Отказ И ЭтотОбъект.Дата > Дата("20220404") тогда
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли; 
		//// Контроль (временно)
		//ОтказПоКонтролю = Контроль(РежимПроведения, ДополнительныеСвойства);
		//
		//Если ОтказПоКонтролю И Не ПропускатьМинус Тогда
		//	
		//	Отказ = Истина;
		//	
		//КонецЕсли; 
	КонецЕсли;   
	
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение);

	
	// Пакушев И.С. Для списания пиловочника по старым регистрам  (временно) 
	// регистр "Запасы организации" 
	Если СтруктурнаяЕдиница.алк_ТипСклада = Перечисления.алк_ТипСклада.Биржа Тогда
		РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры
	
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ТранспортировкаДочка = Документы.алк_РасходнаяНакладная.ДочернийТранспортировка(Ссылка);
	
	Если ЗначениеЗаполнено(ТранспортировкаДочка) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо отменить проведение зависимого документа: " + ТранспортировкаДочка;
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
		
	Иначе 
		
		РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.Свойство("Направление") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.Направление) = Тип("Массив") И ДанныеЗаполнения.Направление.Количество() = 1 Тогда
			
			ЭтотОбъект.Направление = ДанныеЗаполнения.Направление[0];
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область КонтрольОтрицательныхОстатков

Функция Контроль(РежимПроведения, ДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ЗапасыНаСкладахСерииОстатки.Организация,
	|	алк_ЗапасыНаСкладахСерииОстатки.СтруктурнаяЕдиница,
	|	алк_ЗапасыНаСкладахСерииОстатки.Ячейка,
	|	алк_ЗапасыНаСкладахСерииОстатки.Номенклатура,
	|	алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер,
	|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыНаСкладахСерии.Остатки(&МоментИтогов, СерийныйНомер В (&СерийныеНомера)) КАК алк_ЗапасыНаСкладахСерииОстатки
	|ГДЕ
	|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток < 0";
	
	Запрос.УстановитьПараметр("СерийныеНомера", ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладахСерии.ВыгрузитьКолонку("СерийныйНомер"));
	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		МоментИтогов = '00010101';
	Иначе
		МоментИтогов = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
	
	РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
	
	Если НЕ РезультатПоОстаткам.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает запасов: " 
			+ ВыборкаДетальныеЗаписи.СерийныйНомер 
			+ " Организация: " + ВыборкаДетальныеЗаписи.Организация
			+ " Склад: " + ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
			Сообщение.Сообщить(); 	
			
		КонецЦикла;
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
	
КонецФункции // Контроль()

	

#КонецОбласти
